calm water resistance/KCS/Fr0.2816/0.org/include/initialConditions
flowVelocity          (2.379529 0 0);
Umean                  2.379529;
turbulentKE            8.493240e-04;
turbulentOmega         1.634607e+00;
turbulentEpsilon       8.329864e-07;
turbulentNut           3.420000e-06;
transitionTu           1.000000e+00;
transitionLambdaTheta  0.000000e+00;
transitionFLambdaTheta 1.000000e+00;
transitionReThetat     5.843016e+02;
#inputMode       merge;