calm water resistance/KCS/Fr0.2816/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-14.598278223595196 0 -8.076916230267834)
	(21.89741733539279 0 -8.076916230267834)
	(21.89741733539279 9.273496412529735 -8.076916230267834)
	(-14.598278223595196 9.273496412529735 -8.076916230267834)
	(-14.598278223595196 0 3.8888855923511794)
	(21.89741733539279 0 3.8888855923511794)
	(21.89741733539279 9.273496412529735 3.8888855923511794)
	(-14.598278223595196 9.273496412529735 3.8888855923511794)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (122 31 40) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

